In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/working-with-text-and-time-data/text_exercise.XLSX
/kaggle/input/working-with-text-and-time-data/DAwPy_S10_(Working_with_Text_and_Time_Data)_InClass_19.7.23.ipynb
/kaggle/input/working-with-text-and-time-data/time_exercise.csv

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
print('Setup completed!')

/opt/conda/lib/python3.10/site-packages/scipy/__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.23.5
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

Setup completed!

In [3]:
df0 = pd.read_excel('/kaggle/input/working-with-text-and-time-data/text_exercise.XLSX')
df = df0.copy()
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

In [5]:
df["staff"].str.title().str.extract("(\w+)\s(\w+)")

         0       1
0      Tom    Blue
1     John   Black
2  Micheal   Brown
3    Jason  Walker
4     Alex   Green
5    Oscar     Smi
6   Adrian    Star
7   Albert   Simon

In [6]:
df["staff"].str.title().str.split(' ',expand=True)

         0       1
0      Tom    Blue
1     John   Black
2  Micheal   Brown
3    Jason  Walker
4     Alex   Green
5    Oscar  Smi̇th
6   Adrian    Star
7   Albert   Simon

In [7]:
df[['name','surname']] = df["staff"].str.title().str.split(' ',expand=True)
df

,id,staff,department,job,salary,age,name,surname
0,M0001,Tom BLUE,HR,manager,"""$150,000""",52,Tom,Blue
1,M0002,JOHN BLACK,IT,manager,"""$180,000""",48,John,Black
2,E0001,Micheal Brown,IT,data scientist,"""$150,000""",35,Micheal,Brown
3,E0002,jason walker,HR,recruiter,130000dolar,38,Jason,Walker
4,E0003,Alex Green,IT,backend developer,"""$110,000""",-,Alex,Green
5,E0004,OSCAR SMİTH,IT,frontend developer,"""$120,000""",32,Oscar,Smi̇th
6,E0005,Adrian STAR,IT,data scientist,"""$135,000""",40,Adrian,Star
7,E0006,Albert simon,IT,data scientist,125000dolar,35,Albert,Simon

In [8]:
df = df.iloc[:,[0,6,7,2,3,5,4]]
df

      id     name surname department                 job age       salary
0  M0001      Tom    Blue         HR             manager  52   "$150,000"
1  M0002     John   Black         IT             manager  48   "$180,000"
2  E0001  Micheal   Brown         IT      data scientist  35   "$150,000"
3  E0002    Jason  Walker         HR           recruiter  38  130000dolar
4  E0003     Alex   Green         IT   backend developer   -   "$110,000"
5  E0004    Oscar  Smi̇th         IT  frontend developer  32   "$120,000"
6  E0005   Adrian    Star         IT      data scientist  40   "$135,000"
7  E0006   Albert   Simon         IT      data scientist  35  125000dolar

In [9]:
df["salary"].str.findall('\d+,\d+|\d+').str[0]

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [10]:
df["salary"] = df["salary"].str.findall('\d+,\d+|\d+').str[0].str.replace(",","")
df["salary"] = df["salary"].astype(int)
df["salary"]

/tmp/ipykernel_21/1391579778.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["salary"] = df["salary"].str.findall('\d+,\d+|\d+').str[0].str.replace(",","")
/tmp/ipykernel_21/1391579778.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["salary"] = df["salary"].astype(int)

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: int64

In [11]:
type(df.age[0])

int

In [12]:
df.age = df.age.replace('-',np.nan)

/tmp/ipykernel_21/3538647278.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.age = df.age.replace('-',np.nan)

In [13]:
df.age

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

In [14]:
df

      id     name surname department                 job   age  salary
0  M0001      Tom    Blue         HR             manager  52.0  150000
1  M0002     John   Black         IT             manager  48.0  180000
2  E0001  Micheal   Brown         IT      data scientist  35.0  150000
3  E0002    Jason  Walker         HR           recruiter  38.0  130000
4  E0003     Alex   Green         IT   backend developer   NaN  110000
5  E0004    Oscar  Smi̇th         IT  frontend developer  32.0  120000
6  E0005   Adrian    Star         IT      data scientist  40.0  135000
7  E0006   Albert   Simon         IT      data scientist  35.0  125000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   name        8 non-null      object
 2   surname     8 non-null      object
 3   department  8 non-null      object
 4   job         8 non-null      object
 5   age         7 non-null      float64
 6   salary      8 non-null      int64
dtypes: float64(1), int64(1), object(5)
memory usage: 576.0+ bytes